package com.example.wasafatyapp;

public class Descriptions {

    public static  String[] steps = {"1. احضري نوع السمك المناسب، نظفيه جيدًا وافتحيه من الظهر بطريقة مناسبة. \n 2. احضري خطلة الحشو المفرومة في الكبة (بصل وثوم وطماطم وفلفل أخضر وجزر مبشور). \n 3. احضري طاسة وشوحي الخلطة على النار مضافًا إليها الملح والليمون والخل والكمون والفلفل الأسود المطحون. \n 4. قومي بتوزيع الحشو داخل السمك وهو مفتوح واتركيه في الثلاجة لمدة 30 دقيقة كي يتشرب التتبيلة والخلطة. \n 5. ضعي السمك في صينية مناسبه وغطيه بورق القصدير. \n 6. ضعي الصينيه في الفرن حتى اكتمال الطهي. \n 7. اكشفي الورق القصدير وضعي الصينيه كي يتحمر على شواية الفرن.",
            "اسلقي البامية المقمعة قليلًا ثم اشطفيها جيدًا بالماء البارد، فيما يعرف بالبسترة\n" +
                    "حتى تتخلصي من المادة اللزجة، تصلح هذه الطريقة لتحضير البامية قبل التجميد أيضًا.\n" +
                    "احضري الصاج وضعي به قليل من الزيت أو الزبدة وشوحي بها البصل المفروم حتى يأخذ لون ذهبي.\n" +
                    "اسكبي عصير الطماطم المصفاة على في الصاج .\n" +
                    "ضيفي ملح مناسب وكزبرة مجففة.\n" +
                    "ضيفي الفلفل الأخضر والأحمر المقطع واتركي الخليط حتى الغليان.\n" +
                    "ضيفي البامية وغطي الصينيه حتى اكتمال الطهي.\n" +
                    "احضري طاسة وضعي بها قليل من الزبدة والزيت.\n" +
                    "ضيفي الثوم المفروم إلى الطاسة وقلبي جيدًا حتى يأخذ لون ذهبي فاتح (لا تتركي الثوم أكثر من ذلك حتى لا يعطي القدر الطعم المر)\n" +
                    "ضيفي قليل من الكزبرة الناشفة على الثوم.\n" +
                    "اسكبي الثوم على قدر البامية.\n" +
                    "اقفلي الغطاء واتركيه قليلًا قبل التقديم.",
            "قم بتقطيع البصل والبندور الى شرائح صغيرة\n" +
                    "سخن صينية مدهونة بالقليل من الزيت النباتي على نار هادئة\n" +
                    "اسكب شرائح البصل و البندور في الصينية مع تركهم لمدة دقيقتان\n" +
                    "ضع نص ملعقة صغيرة من البهارات العادية و ربع ملعقة صغيرة ملح واخلطهم مع البصل والبندور\n" +
                    "ضع معجون طماطم على شكل اجزاء على المكونات ثم قم بمسحهم على كامل المكونات\n" +
                    "اسكب مقدار ملعقة من الماء على المكونات\n" +
                    "قم بتغطية الصينية واتركها لمدة دقيقتان\n" +
                    "قم بخفق البيض وقم بمسحهم على كامل المكونات ثم بتغطية الصينية واتركها على نار هادئة لمدة ٥ دقائق او لحد الاستواء" +
                    "", "أخلطي العدس الأصفر مع الأرز المصري واغسليهم جيدًا.\n" +
            "ضعي الخليط بعد غسله في قدر مناسب.\n" +
            "ضيفي الماء حتى يصبح مرتفع بمقدار 1سم فوق سطح الخليط.\n" +
            "ضيفي ملح الطعام المناسب وقلبي جيدًا.\n" +
            "غطي القدر وضعيه على نار عالية.\n" +
            "هدي النار عندما يتشرب خليط الأرز والعدس الماء.\n" +
            "سخني الزيت في طاسة على النار.\n" +
            "قومي بسكب الزيت الساخن فوق خليط الأرز بالعدس وقلبي جيدًا.\n" +
            "اتركي القدر قليلًا على نار هادئة حتى تمام التسوية.",
    "في وعاء عميق نضع كوب من الماء الدافىء\n" +
            "ثم نضع ملعقتان كبيرتان من السكر\n" +
            "ونضع ملعقتان صغيرتان من الخميرة الجافة\n" +
            "ومعلقتان كبيرتان من زيت الزيتون\n" +
            "نخلط المكونات مع بعضها البعض\n" +
            "نضيف الطحين بالتدريج\n" +
            "ثم نضيف ملعقة صغيرة من الملح\n" +
            "نخلط المكونات مع بعضها البعض\n" +
            "ثم نقوم بعجن العجينة باليد او باستخدام العجانة لمدة 6 دقائق\n" +
            "في وعاء نظيف نضع ملعقة كبيرة من زيت الزيتون\n" +
            "نشكل العجين على شكل كرة ونضعها في الوعاء\n" +
            "نضع القليل من الزيت على وجه العجين ونتركها ترتاح لمدة ساعة\n" +
            "بعد أن تتخمر العجين نقوم بتقسيمها الى نصفين ونشكل كل نصف على شكل كرة\n" +
            "ثم ناخذ احد النصفين ونقوم بفرده على ورق الخبز\n" +
            "نضع ملعقتان كبيرتان من صلصة البيتزا\n" +
            "ونضع كوبان من الجبن المبشور (موزاريلا او قشقوان او شيدر ) المفضل لديكم\n" +
            "نقوم بخبزها بالفرن لمدة 20-30 دقيقة الى أن تتحمر على درجة حرارة مرتفعة\n" +
            "نقوم بتقطيعها الى 8 قطع متساوية\n",
            "في وعاء عميق نضع الزبدة بدجة حرارة الغرفة\n" +
                    "ثم نضيف السكر الأبيض\n" +
                    "و السكر البني\n" +
                    "نحرك المكونات مع بعضها البعض الى أن يصبح الخليط لين\n" +
                    "نضيف بيضة واحدة بدرجة حرارة الغرفة\n" +
                    "ونضيف معلقة صغيرة من الفانيلا\n" +
                    "نحرك البيض والفانيلا مع الخليط جيدا\n" +
                    "ثم نضع الطحين\n" +
                    "ومعلقة كبيرة من النشا\n" +
                    "ومعلقة صغيرة من البيكينغ باودر\n" +
                    "نقوم بنخل المكونات جيدا\n" +
                    "ونضع الملح\n" +
                    "نخلط المكونات الجافة مع الخليط جيدا الى أن تتجانس جميع المكونات مع بعضها البعض\n" +
                    "نضع كوب من حبيبات الشوكلاتة\n" +
                    "ونحركها مع الخيلط جيدا\n" +
                    "نشكل العجية على شكل كرات\n" +
                    "ونضعها في صينية الخبز\n" +
                    "نضعها بالفرن لمدة 10-15 دقيقة على درجة حرارة 160 درجة مئوية\n" +
                    "نتركها تبرد قليلا ثم نقدمها مع الحليب الساخن او القهوة",
            "قبل البدء في تحضير الكيكة قومي بتشغيل الفرن على درجة حرارة 200 درجة مئوية.\n" +
                    "احضري وعاء وصعيفيه الدقيق والبيكنج بودر والملح ويتم التقليب جيداً.\n" +
                    "قومي بخفق البيض مع السكر والفانيليا في وعاء آخر وذلك من خلال استخدام المضرب الكهربائي حتى الحصول على قوام كريمي.\n" +
                    "ضعي الزبدة واستمري في الخفق حتى أن تمتزج جميع المكونات.\n" +
                    "بعد ذلك ضيفي الدقيق بالتدريج والحليب مع الخفق حتى الحصول على عجينة الكيكة.\n" +
                    "احضري صينية مدهونة بالزبدة ورشيها بالدقيق.\n" +
                    "صبي الخليط في الصينية وضعيها في الفرن لمدة نصف ساعة حتى أن تنضج الكيكة تماماً."
            , "نضع السكر في الكوب الحراري او الغلاية\n" +
            "ثم نضع الكاكو\n" +
            "ونضع قطع الشوكلاتة\n" +
            "ثم نقوم بسكب الحليب السائل\n" +
            "نحرك المكونات ببطئ\n" +
            "ثم نضعها على نار هادئة ونستمر بالتحريك حتى تذوب الشوكلاتة ويغلي المشروب\n" +
            "نزين المشروب بقطع المارشملو والشوكلاتة"
            , "نقوم بغسل حبة الأفوكادو وتقطيعها لنصفين\n" +
            "نزيل القشرة الخارجية عنها\n" +
            "في الخلاط الكهربائي نضع كوب من الحليب السائل\n" +
            "نضع الأفوكادو\n" +
            "و نضيف الموز\n" +
            "ثم نضع القشطة\n" +
            "ونضيف العسل حسب الرغبة\n" +
            "نقوم بخلط جميع المكونات جيدا\n" +
            "ثم نسكب العصير في كوب التقديم\n" +
            "ونضع فوقه المكسرات\n" +
            "ونضع القليل من العسل فوق المكسرات \"اختياري\""
            , "في كوب نضع اوراق النعناع الطازجة مع الليمون\n" +
            "نضع نصف كوب من المشروب الأزرق\n" +
            "نضع نصف كوب من الثلج\n" +
            "نحرك المكونات مع بعضها البعض\n" +
            "نضع ربع كوب من المشروب الأزرق\n" +
            "نضع ربع كوب من السفن\n" +
            "نقوم بتزينه بأوراق النعناع والليمون\n" +
            "خطوات عمل موهيتو فراولة بالسفن\n" +
            "نقوم بتقطيع الفراولة ووضعها في الكوب\n" +
            "نضع شرائح الليمون واوراق النعناع الطازجة\n" +
            "نقوم بسكب نصف كوب من السفن اب\n" +
            "نقوم بتحريك المكونات مع بعضها البعض\n" +
            "نضع نصف كوب من الثلج\n" +
            "نقوم بملء الكأس بالسفن اب\n" +
            "نزين الكأس بأوراق النعناع والليمون والفراولة"
            , "نقوم بوضع الطحين في وعاء كبير\n" +
            "ثم نضع البيكينغ باودر\n" +
            "ونضع بيكربونات الصوديوم\n" +
            "ونضع النسكافيه\n" +
            "ونخلط المكونات الجافة مع بعضها البعض\n" +
            "في وعاء عميق نضع البيض\n" +
            "نضيف فوقه السكر الأبيض والفانيلا\n" +
            "ونخلط السكر مع البيض جيدا\n" +
            "ثم نضع الزيت ونخلط\n" +
            "ثم نسكب الحليب و نخلط جميع المكونات مع بعضها البعض\n" +
            "نقوم بإضافة المكونات الجافة بالتدريج\n" +
            "نقوم بخليط المزيج جيدا حتى تتجانس جميع المكونات مع بعضها البعض\n" +
            "نسكب الخليط في صينية الخبز\n" +
            "ونضعها بالفرن لمدة 45 دقيقة على درجة حرارة 180 درجة مئوية\n" +
            "لعمل المشروب الخاص بالكيك\n" +
            "نضع الماء الساخن في الكوب\n" +
            "ثم نضع السكر والنسكافية\n" +
            "نحرك جميع المكونات مع بعضها ونترك المشروب جانبا\n" +
            "لعمل الكروكان\n" +
            "نضع السكر الابيض في المقلاة\n" +
            "ثم نضع اللوز أو اي نوع من المكسرات المفضلة لديكم\n" +
            "نضع المقلاة على النار ونستمر بالتحريك حتى يتحول السكر الى اللون البني\n" +
            "ثنقوم بوضع الكروكان على ورق الالمنيوم بعد دهنه بالزيت\n" +
            "نتركه يبرد في درجة حرارة الغرفة ثم نقوم بكسره لقطع صغيرة\n" +
            "تزين الكيك\n" +
            "بقوم بعمل ثقوب صغيرة بالكيك باستخدام الشوكة\n" +
            "ثم نقوم بتشريب الكيك بخليط النسكافيه والسكر\n" +
            "ثم نضع القشطة ونقوم بتوزيعها\n" +
            "نقوم بوضع الكروكان فوق القشطة\n"
            , "في وعاء عميق نضع الزبدة المذابة\n" +
            "نضع معلقة الزيت\n" +
            "نضيف السكر الأبيض\n" +
            "ونضيف السكر البني\n" +
            "نحرك جميع المكونات مع بعضها البعض\n" +
            "نضع البيض\n" +
            "ونضيف الفانيلا\n" +
            "نحرك جميع المكونات مع بعضها جيدا حتى تمتزج\n" +
            "نضع الطحين في المصفاة\n" +
            "ونضع الكاكو\n" +
            "ونقوم بتنخيل الطحين والكاكو للتخلص من أي تكتلات\n" +
            "نقوم بتقليب الطحين والكاكو مع باقي المكونات حتى يصبح لدينا عجينة لينة\n" +
            "نقوم بتقطيع لوح الشوكلاتة الى قطع صغيرة\n" +
            "ونضيفه الى الخليط ونقلب\n" +
            "ثم نصب الخليط في صينية الخبز\n" +
            "ونضعها بالفرن لمدة 20-250 دقيقة على درجة حرارة 180 درجة مئوية\n" +
            "نتركها لتبرد قليلا ثم نقوم بتقطيعها الى قطع متساوية\n" +
            "نضيف الأيس كريم \" اختياري\" ونزينها بقطع الفاكهة"
            , "اخلطي الزبدة والسميد والسكر البودرة والحليب البودرة والبيكنج باودر وافركهم باليد جيدًا.\n" +
            "ضيفي علب القشطة الثلاثة، وحركي الخليط جيدًا الى ان يصبح عجينة طرية.\n" +
            "ادهني صينية الفرن بالزبدة، ثم اسكبي فوقها نصف كمية الخليط.\n" +
            "اخفقي القشطة الطازجة جيدًا بالمعلقة الى ان يصبح قوامها سائل، واسكبيها فوق البسبوسة.\n" +
            "اسكبي باقي الخليط فوق طبقة القشطة بالتدريج؛ لكي لا تختلط طبقات البسبوسة بالقشطة.\n" +
            "اخبزيها بفرن على درجة حرارة 175، واسكبي عليها القطر فور إخراجها.\n" +
            "زينيها بالفستق الحلبي، وقدميها ساخنة مع فنجان قهوة، وصحة وعافية."
    };
    public static String[] contents = {"4 سمكة سمك متنظف جيدًا ومفتوح بالطول من الظهر\n" +
            "1 بصلة مفرومة\n" +
            "4 فصوص ثوم\n" +
            "1 ملعقة زيت\n" +
            "4 ليمون\n" +
            "2 ملعقة خل\n" +
            "1 ملعقة ملح طعام\n" +
            "1 ملعقة كمون مطحون\n" +
            "1 ملعقة فلفل أسود\n" +
            "1 فلفل أخضر\n" +
            "1 جزرة مبشورة\n" +
            "1 طماطم", "1 بصلة مفرومة\n" +
            "5 ثمرات طماطم معصورة ومصفاه\n" +
            "7 فصوص ثوم مفروم\n" +
            "نصف كيلو بامية مقمعة (بعد عملية التنظيف)\n" +
            "1 ملعقة ملح\n" +
            "1 ملعقة كزبرة\n" +
            "5 ثمرات فبفل رومي وفلفل أحمر مقطع\n" +
            "قليل من الزيت والزبدة", "٣ بيضات\n" +
            "١ زيت نباتي\n" +
            "١ بصلة متوسطة الحجم\n" +
            "١ بندورة متوسطة الحجم\n" +
            "١ معجون طماطم\n" +
            "½ نص ملعقة صغيرة بهارات\n" +
            "¼ ربع ملعقة صغيرة ملح", "1 كوب أرز مصري\n" +
            "0.5 كوب عدس أصفر عدس منزوع القشر\n" +
            "1.5 كوب ماء\n" +
            "1 ملعقة ملح طعام\n" +
            "0.5 كوب زيت نباتي\n" +
            "1 بصلة مقطعة اختياري",
    "1 كوب ماء دافيء\n" +
            "2 معقلة كبيرة سكر\n" +
            "2 معلقة صغيرة خميرة جافة\n" +
            "2 معلقة كبيرة زيت زيتون\n" +
            "2 كوب طحين\n" +
            "1 معلقة صغيرة ملح\n" +
            "2 معلقة كبيرة صلصلة البيتزا\n" +
            "2 كوب جبنة مبشورة",
    "100 غم زبدة بدرجة حرارة الغرفة\n" +
            "1/3 كوب سكر ابيض\n" +
            "1/2 كوب سكر بني\n" +
            "1 حبة بيض بدرجة حرارة الغرفة\n" +
            "1 معلقة صغيرة فانيلا\n" +
            "1 1/4 كوب طحين\n" +
            "1 معلقة كبيرة نشا الذرة\n" +
            "1 معلقة صغيرة بيكينغ باودر\n" +
            "1/2 معلقة صغيرة ملح\n" +
            "1 كوب شوكلاتة",
            "2 كوب من الدقيق.\n" +
                    "كوب ونصف سكر.\n" +
                    "2 ملعقة صغيرة بيكنج بودر.\n" +
                    "ملعقة صغيرة من بيكنج صودا.\n" +
                    "نصف ملعقة من الملح.\n" +
                    "3 بيضات.\n" +
                    "ملعقة صغيرة من الفانيليا.\n" +
                    "كوب إلا ربع من الزبدة.\n" +
                    "كوب وربع من الحليب."
            , "2 معلقة كبيرة كاكو خام غير محلى\n" +
            "2 معلقة كبيرة سكر أبيض\n" +
            "1.5 كوب حليب سائل\n" +
            "100 غم شوكلاتة"
            , "1 حبة افوكادو\n" +
            "1 حبة موز\n" +
            "1 كوب حليب سائل\n" +
            "1 كوب قشطة\n" +
            "1 معلقة كبيرة عسل\n" +
            "1 معلقة كبيرة مكسرات"
            , "موهيتو ازرق\n" +
            "250 مل مشروب ازرق\n" +
            "١ حبة ليمون\n" +
            "1/2 كوب اوراق نعناع طازج\n" +
            "½ كوب ثلج\n" +
            "موهيتو فراولة بالسفن\n" +
            "250 مل سفن اب\n" +
            "¼ كوب فروالة\n" +
            "½ كوب ثلج\n" +
            "١ حبة ليمون\n" +
            "1/2 كوب اوراق نعناع طازج"
            , "لعمل خليط الكيك\n" +
            "3 حبة بيض\n" +
            "1 كوب سكر ابيض\n" +
            "1 معلقة صغيرة فانيلا\n" +
            "3/4 كوب زيت نباتي\n" +
            "1 كوب حليب سائل\n" +
            "3 كوب طحين\n" +
            "1 معلقة كبيرة بيكينغ باودر\n" +
            "1/2 معلقة صغيرة بيكربونات الصوديوم\n" +
            "2 معلقة كبيرة قهوة سريعة الذوبان \"نسكافية\"\n" +
            "1 علبة قشطة \"قيمر\"\n" +
            "لعمل الشراب للكيكة\n" +
            "1/2 كوب ماء ساخن\n" +
            "2 معلقة كبيرة قهوة سريعة الذوبان\n" +
            "1 معلقة كبيرة سكر\n" +
            "لعمل الكروكان\n" +
            "1 كوب سكر ابيض\n" +
            "1/2 كوب لوز"
            , "100 غم زبدة مذابة\n" +
            "1 معلقة كبيرة زيت نباتي\n" +
            "1/2 كوب سكر أبيض\n" +
            "1/2 كوب سكر بني\n" +
            "1/2 كوب كاكو غير محلى\n" +
            "1/2 كوب طحين\n" +
            "2 حبة بيض في درجة حرارة الغرفة\n" +
            "1 معلقة صغيرة فانيلا\n" +
            "150 غم شوكلاتة"
            , "كوب ونصف سميد ناعم\n" +
            "كوب وربع سكر بودرة\n" +
            "كوب ونصف حليب بودرة\n" +
            "ملعقة ونصف صغيرة بيكنج باودر\n" +
            "قالب زبدة بحرارة الغرفة\n" +
            "ثلاث علب قشطة\n" +
            "سبع علب قشطة صغيرة الحجم للحشوة\n" +
            "كوب واحد قطر\n" +
            "فستق حلبي للتزيين ( حسب الرغبة )"
    };
}
